# IFCHybrid Import Options Properties

Source: https://www.revitapidocs.com/2026/ce96b584-f07f-0a8c-acb2-f007c4753e02.htm

---

| IFCHybrid Import Options Properties |
| --- |

The IFCHybridImportOptions type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | HybridGrids | True if we should use AnyCAD to process grids, false otherwise. |
|  | HybridLevels | True if we should use AnyCAD to process levels, false otherwise. |
|  | HybridPropertySets | True if we should use AnyCAD to process property sets, false otherwise. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top See Also

#### Reference

IFCHybridImportOptions Class Autodesk.Revit.DB.IFC Namespace